app/Http/Livewire/FeaturedComponents.php

    public function render()
    {


        $fproducts=products::where('condition','=',$this->name)->get();


        return view('livewire.featured-components')->with('products',$fproducts)->layout('layouts.base');
---
select * from `products` where `condition` = 'hot'