app/Http/Livewire/HomeComponent.php

    public function Savenewsletter(){


        $this->validate([
            'email'=>'required | email'
        ]);
        $edata=Newsletter::where('email','=', $this->email)->first();
---
select * from `newsletters` where `email` = 'tuhin@gmail.com' limit 1

    public function render()
    {


        $allproducts=new products();
        $banner=banners::where('status', 1)->get();
        $data = $allproducts::where(['status'=>'active','stock_status'=>'instock'])->orderBy('id','DESC')->limit(8)->get();

        $category = Home_categories::find(1);
        $cats = explode(',',$category->sel_categories);
        $categories = Categories::whereIn('Id',$cats)->get();
        $no_of_products = $category->no_of_products;
        $maincategories=Categories::all();
        // dd($maincategories);

        $mainsubcategories=subcategories::all();
        // dd($mainsubcategories);

        $totalcategories=Categories::all();
---
select * from `home_categories` where `home_categories`.`id` = 1 limit 1
select * from `categories` where `Id` in ('2', '4', '6', '8', '11', '13')
select * from `categories`