app/Http/Livewire/ShopComponent.php

    public function render()
    {
        if($this->sorting=='date')
        {
            $products = products::whereBetween('price',[$this->min_price,$this->max_price])->orderBy('created_at','DESC')->paginate($this->pagesize);


        }
        else if($this->sorting=="price")
        {
            $products = products::whereBetween('price',[$this->min_price,$this->max_price])->orderBy('price','ASC')->paginate($this->pagesize);
        }
        else if($this->sorting=="price-desc")
        {
            $products = products::whereBetween('price',[$this->min_price,$this->max_price])->orderBy('price','DESC')->paginate($this->pagesize);
        }
        else
        {
            $products = products::whereBetween('price',[$this->min_price,$this->max_price])->paginate($this->pagesize);
        }


        $categories = Categories::with('subcategory')->get();
---
select * from `categories`
select * from `subcategories` where `subcategories`.`categories_id` in (1, 2, 3, 4, 5, 6, 7, 8, 15, 16)